Revit 2024 API
Application.IsLoggedIn Property
 Checks if the user is logged in from this session to their Autodesk account.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public static bool IsLoggedIn { get; }
Visual Basic
Public Shared ReadOnly Property IsLoggedIn As Boolean
	Get
Visual C++
public:
static property bool IsLoggedIn {
	bool get ();
}
See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace